html/erlang/tutorial/sequential/condition.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>条件判断</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="../css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="list_method.html"> UP </a>
 |
 <a accesskey="H" href="sequential.html"> HOME </a>
</div><div id="content">
<h1 class="title">条件判断</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org911f433">if</a></li>
<li><a href="#org7bb4b0a">case</a></li>
</ul>
</div>
</div>

<div id="outline-container-org911f433" class="outline-2">
<h2 id="org911f433">if</h2>
<div class="outline-text-2" id="text-org911f433">
<pre class="example">
前面的 find_max_and_min 函数里已经用到了 if 
</pre>
<p>
现在介绍一个新的结构 <span class="underline">if</span> 。If 的语法格式如下：
</p>

<pre class="example">
if
    Condition 1 -&gt;
	Action 1;
    Condition 2 -&gt;
	Action 2;
    Condition 3 -&gt;
	Action 3;
    Condition 4 -&gt;
	Action 4
end
</pre>

<p>
<span class="underline">条件</span> 的工作方式与 guard 一样，即 <b>测试</b> 并返回 <span class="underline">成功</span> 或者 <span class="underline">失败</span> ：
</p>
<ul class="org-ul">
<li>Erlang 从第一个条件开始测试一直到找到一个测试为真的分支，随后，执行该条件后的动作，且忽略其它在 end 前的条件与动作</li>
<li>如果所有条件都测试失败，则会产生运行时错误</li>
<li>一个测试恒为真的条件就是 <span class="underline">true</span> ：它常用作 if 的最后一个条件，即当所有条件都测试失败时，则执行 true 后面的动作</li>
</ul>

<pre class="example">
注意：在 end 之前没有 “;”
</pre>

<p>
下面这个例子说明了 if 的工作方式：
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #ffd700;">-module</span>(conds).
<span style="color: #ffd700;">-export</span>([<span style="color: #98f5ff;">test_if/2</span>]).

<span style="color: #daa520; font-weight: bold;">test_if</span>(<span style="color: #4eee94;">A</span>, <span style="color: #4eee94;">B</span>) -&gt;
    <span style="color: #00bfff; font-weight: bold;">if</span> 
        <span style="color: #4eee94;">A</span> == 5 -&gt;
            <span style="color: #98f5ff;">io</span>:<span style="color: #98f5ff;">format</span>(<span style="color: #deb887;">"A == 5~n"</span>, []),
            a_equals_5;
        <span style="color: #4eee94;">B</span> == 6 -&gt;
            <span style="color: #98f5ff;">io</span>:<span style="color: #98f5ff;">format</span>(<span style="color: #deb887;">"B == 6~n"</span>, []),
            b_equals_6;
        <span style="color: #4eee94;">A</span> == 2, <span style="color: #4eee94;">B</span> == 3 -&gt;<span style="color: #daa520; font-weight: bold;"> </span>                     <span style="color: #5f9ea0; font-style: italic;">%</span><span style="color: #5f9ea0; font-style: italic;">That is A equals 2 and B equals 3</span>
            <span style="color: #98f5ff;">io</span>:<span style="color: #98f5ff;">format</span>(<span style="color: #deb887;">"A == 2, B == 3~n"</span>, []),
            a_equals_2_b_equals_3;
        <span style="color: #4eee94;">A</span> == 1 ; <span style="color: #4eee94;">B</span> == 7 -&gt;<span style="color: #daa520; font-weight: bold;"> </span>                    <span style="color: #5f9ea0; font-style: italic;">%</span><span style="color: #5f9ea0; font-style: italic;">That is A equals 1 or B equals 7</span>
            <span style="color: #98f5ff;">io</span>:<span style="color: #98f5ff;">format</span>(<span style="color: #deb887;">"A == 1 ; B == 7~n"</span>, []),
            a_equals_1_or_b_equals_7
    <span style="color: #00bfff; font-weight: bold;">end</span>.
</pre>
</div>
<p>
测试该程序：
</p>

<div class="org-src-container">
<pre class="src src-sh">8&gt; conds:test_if(5,33)<span style="color: #f08080;">.</span> 
A == 5
a_equals_5

9&gt; conds:test_if(33,6)<span style="color: #f08080;">.</span> 
B == 6
b_equals_6

10&gt; conds:test_if(2,3)<span style="color: #f08080;">.</span>  
A == 2, B == 3
a_equals_2_b_equals_3

11&gt; conds:test_if(1,33)<span style="color: #f08080;">.</span> 
A == 1 ; B == 7
a_equals_1_or_b_equals_7

12&gt; conds:test_if(33,33)<span style="color: #f08080;">.</span>  
** exception error: no true branch found when evaluating an if expression
     <span style="color: #00bfff; font-weight: bold;">in</span> <span style="color: #00bfff; font-weight: bold;">function</span>  <span style="color: #daa520; font-weight: bold;">conds</span>:test_if/2 (conds.erl, line 5)
</pre>
</div>

<pre class="example">
注意：conds:test_if(33,33) 使得所有测试条件都失败，这将导致产生一个 if_clause 运行时错误
</pre>
</div>
</div>

<div id="outline-container-org7bb4b0a" class="outline-2">
<h2 id="org7bb4b0a">case</h2>
<div class="outline-text-2" id="text-org7bb4b0a">
<p>
Erlang 中还有一种 <span class="underline">case</span> 结构。回想一下前面的 convert_length 函数：
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #daa520; font-weight: bold;">convert_length</span>({centimeter, <span style="color: #4eee94;">X</span>}) -&gt;
    {inch, <span style="color: #4eee94;">X</span> / 2.54};
<span style="color: #daa520; font-weight: bold;">convert_length</span>({inch, <span style="color: #4eee94;">Y</span>}) -&gt;
    {centimeter, <span style="color: #4eee94;">Y</span> * 2.54}.
</pre>
</div>

<p>
该函数也可以用 case 实现，如下所示：
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #ffd700;">-module</span>(conds).
<span style="color: #ffd700;">-export</span>([<span style="color: #98f5ff;">convert_length/1</span>]).

<span style="color: #daa520; font-weight: bold;">convert_length</span>(<span style="color: #4eee94;">Length</span>) -&gt;
    <span style="color: #00bfff; font-weight: bold;">case</span> <span style="color: #4eee94;">Length</span> <span style="color: #00bfff; font-weight: bold;">of</span>
        {centimeter, <span style="color: #4eee94;">X</span>} -&gt;
            {inch, <span style="color: #4eee94;">X</span> / 2.54};
        {inch, <span style="color: #4eee94;">Y</span>} -&gt;
            {centimeter, <span style="color: #4eee94;">Y</span> * 2.54}
    <span style="color: #00bfff; font-weight: bold;">end</span>.
</pre>
</div>

<p>
无论是 case 还是 if 都有返回值
</p>
<pre class="example">
这也就是说，上面的例子中，case 语句要么返回 {inch,X/2.54} 要么返回 {centimeter,Y*2.54}。
</pre>
<p>
case 语句也可以用 <span class="underline">guard 子句</span> 来实现。下面的例子可以帮助你分清二者。这个例子中，输入年份得到指定某月的天数。年份必须是已知的，因为闰年的二月有 29 天，所以必须根据年份才能判断二月的天数：
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #ffd700;">-module</span>(conds).
<span style="color: #ffd700;">-export</span>([<span style="color: #98f5ff;">month_length/2</span>]).

<span style="color: #daa520; font-weight: bold;">month_length</span>(<span style="color: #4eee94;">Year</span>, <span style="color: #4eee94;">Month</span>) -&gt;
    <span style="color: #5f9ea0; font-style: italic;">%% </span><span style="color: #5f9ea0; font-style: italic;">&#34987; 400 &#25972;&#38500;&#30340;&#20026;&#38384;&#24180;&#12290;</span>
    <span style="color: #5f9ea0; font-style: italic;">%% </span><span style="color: #5f9ea0; font-style: italic;">&#34987; 100 &#25972;&#38500;&#20294;&#19981;&#33021;&#34987; 400 &#25972;&#38500;&#30340;&#19981;&#26159;&#38384;&#24180;&#12290;</span>
    <span style="color: #5f9ea0; font-style: italic;">%% </span><span style="color: #5f9ea0; font-style: italic;">&#34987; 4 &#25972;&#38500;&#20294;&#19981;&#33021;&#34987; 100 &#25972;&#38500;&#30340;&#20026;&#38384;&#24180;&#12290;</span>
    <span style="color: #4eee94;">Leap</span> = <span style="color: #00bfff; font-weight: bold;">if</span>
        <span style="color: #f08080;">trunc</span>(<span style="color: #4eee94;">Year</span> / 400) * 400 == <span style="color: #4eee94;">Year</span> -&gt;
            leap;
        <span style="color: #f08080;">trunc</span>(<span style="color: #4eee94;">Year</span> / 100) * 100 == <span style="color: #4eee94;">Year</span> -&gt;
            not_leap;
        <span style="color: #f08080;">trunc</span>(<span style="color: #4eee94;">Year</span> / 4) * 4 == <span style="color: #4eee94;">Year</span> -&gt;
            leap;
        true -&gt;
            not_leap
    <span style="color: #00bfff; font-weight: bold;">end</span>,  
    <span style="color: #00bfff; font-weight: bold;">case</span> <span style="color: #4eee94;">Month</span> <span style="color: #00bfff; font-weight: bold;">of</span>
        sep -&gt;<span style="color: #daa520; font-weight: bold;"> </span>30;
        apr -&gt;<span style="color: #daa520; font-weight: bold;"> </span>30;
        jun -&gt;<span style="color: #daa520; font-weight: bold;"> </span>30;
        nov -&gt;<span style="color: #daa520; font-weight: bold;"> </span>30;
        feb <span style="color: #00bfff; font-weight: bold;">when</span> <span style="color: #4eee94;">Leap</span> == leap -&gt;<span style="color: #daa520; font-weight: bold;"> </span>29;
        feb -&gt;<span style="color: #daa520; font-weight: bold;"> </span>28;
        jan -&gt;<span style="color: #daa520; font-weight: bold;"> </span>31;
        mar -&gt;<span style="color: #daa520; font-weight: bold;"> </span>31;
        may -&gt;<span style="color: #daa520; font-weight: bold;"> </span>31;
        jul -&gt;<span style="color: #daa520; font-weight: bold;"> </span>31;
        aug -&gt;<span style="color: #daa520; font-weight: bold;"> </span>31;
        oct -&gt;<span style="color: #daa520; font-weight: bold;"> </span>31;
        dec -&gt;<span style="color: #daa520; font-weight: bold;"> </span>31
    <span style="color: #00bfff; font-weight: bold;">end</span>.
</pre>
</div>

<p>
测试：
</p>

<div class="org-src-container">
<pre class="src src-sh">16&gt; conds:month_length(2004,feb)<span style="color: #f08080;">.</span>  
29

17&gt; conds:month_length(2003,feb)<span style="color: #f08080;">.</span>  
28

18&gt; conds:month_length(1947,jan)<span style="color: #f08080;">.</span>  
31

19&gt; conds:month_length(1947,jan1)<span style="color: #f08080;">.</span>  
** exception error: no case clause matching jan1
     <span style="color: #00bfff; font-weight: bold;">in</span> <span style="color: #00bfff; font-weight: bold;">function</span>  <span style="color: #daa520; font-weight: bold;">conds</span>:month_length/2 (conds.erl, line 42)
</pre>
</div>

<pre class="example">
从例子中可以看出：when是不一定需要返回值的！
</pre>

<p>
<a href="built_in_function.html">Next：内置函数</a>
</p>

<p>
<a href="list_method.html">Previous：列表操作</a>
</p>

<p>
<a href="sequential.html">Home：顺序编程</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
